import {type FC, memo} from "react";

// функція memo() - запам'ятовує дані в компоненті, щоб не відбувався ререндерінг даного компоненту UserComponent,
// зміни відбуваються тільки тоді, коли змінуються данні всередині компоненти чи передані пропси
// Важливо: не треба все мемомізовувати, це сповільнює роботу системи, тільки коли це вартує цього, наприклад дуже багато рендериться
// інформації, чи виконується логіка, цикли з великим обсягом даних

// Прокинемо функцію foo до компоненти, в такому випадку UserComponent знову виконається вдруге, тому що функція
// з компонента UsersComponent будується наново і фактично робить нове посилання, яке викликає ререндер UserComponent
// при цьому сама foo не змінюється, щоб ререндер не відбувався в цьому випадку треба використовувати хук useCallback(див.UsersComponent)
const UserComponent: FC<{ foo: () => void, arr: number[], item: {name:string} }> = memo(({arr, item}) => {

    console.log("User");
    console.log(arr);
    return (
        <div>
            <div>{item.name}</div>
        </div>
    );
});
export default UserComponent;