import {memo} from "react";

// функція memo() - запам'ятовує дані в компоненті, щоб не відбувався ререндерінг даного компоненту UserComponent,
// зміни відбуваються тільки тоді, коли змінуються данні всередині компоненти чи передані пропси
// Важливо: не треба все мемомізовувати, це сповільнює роботу системи, тільки коли це вартує цього, наприклад дуже багато рендериться
// інформації, чи виконується логіка, цикли з великим обсягом даних
const UserComponent = memo(() => {

    console.log("User");
    return (
        <div>
            <>user</>
        </div>
    );
});
export default UserComponent;